# IsScaleValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Outline..::..IsScaleValid Method
Outline Class See Also
---
Checks if given scale is valid. Should be greater than zero.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsScaleValid(
	double scale
)
```

Visual Basic
---
```text
Public Function IsScaleValid ( _
	scale As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool IsScaleValid(
	double scale
)
```

# ### Parameters
scale
    Type: System..::..Double The scale.
# ### Return Value
True if the scale is valid, false otherwise.
# See Also
Outline Class
Autodesk.Revit.DB Namespace